//DLISBIND JOB (DLIS),'DLIS DB2 BIND',CLASS=A,
//         MSGCLASS=X,NOTIFY=&SYSUID
//*================================================================*
//* JOB   : DLISBIND                                               *
//* Desc  : DB2 BIND all DLIS DBRM members into packages and plans *
//*================================================================*

//STEP010  EXEC PGM=IKJEFT01
//STEPLIB  DD DSN=DSN.SDSNEXIT,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSTSIN  DD *
  DSN SYSTEM(DSN1)

  BIND PACKAGE(DLISPKG) -
       MEMBER(DLISCAND) -
       LIBRARY('DLIS.DBRM') -
       ISOLATION(CS) VALIDATE(BIND) RELEASE(DEALLOCATE)

  BIND PACKAGE(DLISPKG) -
       MEMBER(DLISAPPL) -
       LIBRARY('DLIS.DBRM') -
       ISOLATION(CS) VALIDATE(BIND) RELEASE(DEALLOCATE)

  BIND PACKAGE(DLISPKG) -
       MEMBER(DLISELIG) -
       LIBRARY('DLIS.DBRM') -
       ISOLATION(CS) VALIDATE(BIND) RELEASE(DEALLOCATE)

  BIND PACKAGE(DLISPKG) -
       MEMBER(DLISHIST) -
       LIBRARY('DLIS.DBRM') -
       ISOLATION(CS) VALIDATE(BIND) RELEASE(DEALLOCATE)

  BIND PACKAGE(DLISPKG) -
       MEMBER(DLISPAY) -
       LIBRARY('DLIS.DBRM') -
       ISOLATION(CS) VALIDATE(BIND) RELEASE(DEALLOCATE)

  BIND PACKAGE(DLISPKG) -
       MEMBER(DLISAP1) -
       LIBRARY('DLIS.DBRM') -
       ISOLATION(CS) VALIDATE(BIND) RELEASE(DEALLOCATE)

  BIND PACKAGE(DLISPKG) -
       MEMBER(DLISAP2) -
       LIBRARY('DLIS.DBRM') -
       ISOLATION(CS) VALIDATE(BIND) RELEASE(DEALLOCATE)

  BIND PACKAGE(DLISPKG) -
       MEMBER(DLISISSU) -
       LIBRARY('DLIS.DBRM') -
       ISOLATION(CS) VALIDATE(BIND) RELEASE(DEALLOCATE)

  BIND PACKAGE(DLISPKG) -
       MEMBER(DLISSTAT) -
       LIBRARY('DLIS.DBRM') -
       ISOLATION(CS) VALIDATE(BIND) RELEASE(DEALLOCATE)

  BIND PLAN(DLISPLAN) -
       PKLIST(DLISPKG.*) -
       ISOLATION(CS) VALIDATE(BIND) RELEASE(DEALLOCATE) -
       CURRENTDATA(NO)

  END
